app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @book = Book.new
    @books = Book.all
    @user = User.find(current_user.id)

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["user_id", 1], ["created_at", "2020-03-16 10:48:04.648615"], ["updated_at", "2020-03-16 10:48:04.648615"]]
---
  def create
    book = Book.new(book_params)
    book.user_id = current_user.id
   if book.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @user = User.find(current_user.id)
    # ↑ 指定し忘れやすい
    @book = Book.find(params[:id])