app/controllers/books_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @book_error = Book.new(book_params)
    @books = Book.all
    @book_error.user_id = current_user.id
    if @book_error.save
      flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book_error.id)
    else
      @book = Book.new
      @books = Book.all
      @user = User.find(current_user.id)

SELECT "users".* FROM "users"
---
  def show
    @users = User.all