app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @users = User.all
    @user = User.find(current_user.id)

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @books = Book.all
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find(current_user.id)